---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.IsEqual(Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings)
source: html/54b1997b-1003-6f98-97f6-90fd2edb786e.htm
---
# Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.IsEqual Method

Check if the contents of two instances of settings are equal.

## Syntax (C#)
```csharp
public bool IsEqual(
	DirectContext3DHandleSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings`) - The settings to be compared.

## Returns
True for equal, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null